In [58]:
import pandas as pd

In [59]:
#read the dataset and we can see the features and y
data = pd.read_excel('Decision Tree.xlsx')
data.head(10)

  car_company       type  cylinder  over 1200 hp
0         BMW      sport         6             0
1         BMW      sport         8             1
2         BMW      SEDAN         4             0
3         BMW      COUPE         6             1
4      Toyota      sport         6             1
5      Toyota      COUPE         6             0
6      Toyota  HATCHBACK         4             0
7      Toyota      sport         4             0
8    Mercedes      COUPE         8             0
9    Mercedes      sport         8             1

In [60]:
data.shape

(16, 4)

In [61]:
# now want to split mt features in dataset and y in dataset
#axis 1 mean coulmn
X = data.drop("over 1200 hp", axis=1)

In [62]:
y = data['over 1200 hp']

In [63]:
print('X shape is {} and y shape is {} ' .format(X.shape,y.shape))

X shape is (16, 3) and y shape is (16,)

**Now we have to convert labels coulmns like car company, type to digtal because ML can deal with digtal numbers**

In [64]:
# import library  for label encoder
from sklearn.preprocessing import LabelEncoder
le_car_com = LabelEncoder()
le_type = LabelEncoder()

In [65]:
# will add new coulmns for digital number car_company, type
X['car_company_number'] = le_car_com.fit_transform(X['car_company'])
X['type_number'] = le_type.fit_transform(X['type'])

In [66]:
X

   car_company       type  cylinder  car_company_number  type_number
0          BMW      sport         6                   0            3
1          BMW      sport         8                   0            3
2          BMW      SEDAN         4                   0            2
3          BMW      COUPE         6                   0            0
4       Toyota      sport         6                   3            3
5       Toyota      COUPE         6                   3            0
6       Toyota  HATCHBACK         4                   3            1
7       Toyota      sport         4                   3            3
8     Mercedes      COUPE         8                   1            0
9     Mercedes      sport         8                   1            3
10    Mercedes      sport         6                   1            3
11    Mercedes      SEDAN         4                   1            2
12  Rang Rover      sport         8                   2            3
13  Rang Rover  HATCHBACK         4                   2            1
14  Rang Rover      sport         6                   2            3
15  Rang Rover      COUPE         6                   2            0

As we can see converted labels to digital numbers where BMW = 0 and soo on.

In [67]:
# Now we do not need label coulmns so we have to drop it to train our model
X = X.drop(['car_company' , 'type'], axis=1)

In [68]:
X

    cylinder  car_company_number  type_number
0          6                   0            3
1          8                   0            3
2          4                   0            2
3          6                   0            0
4          6                   3            3
5          6                   3            0
6          4                   3            1
7          4                   3            3
8          8                   1            0
9          8                   1            3
10         6                   1            3
11         4                   1            2
12         8                   2            3
13         4                   2            1
14         6                   2            3
15         6                   2            0

**Data Now Ready**

Note:There are more techniques for data processing as removing dublicates rows or deal with NAN values or sometimes outliers values.

In [69]:
# Remember You have to split your dataset for train and test
from sklearn.model_selection import train_test_split
Xtrain , Xtest , Ytrain , Ytest = train_test_split(X , y , test_size=0.2 , random_state=1)

In [70]:
# import our model
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [71]:
# train our model for the dataset
model.fit(Xtrain,Ytrain)

DecisionTreeClassifier()

In [72]:
# calculate accuracy on train dataset
model.score(Xtrain,Ytrain)

1.0

In [73]:
# try to predict the Xtest and Ytest
final = model.predict(Xtest)
final

array([1, 0, 1, 0])

In [74]:
#accuracy on test dataset
model.score(Xtest,Ytest)

0.75

In [75]:
# add the y to Xtest and car_company coulmn and type 
Xtest['over 1200 hp'] = final
Xtest['car_company'] = data['car_company']
Xtest['type'] = data['type']

Xtest

    cylinder  car_company_number  ...  car_company       type
3          6                   0  ...          BMW      COUPE
13         4                   2  ...   Rang Rover  HATCHBACK
7          4                   3  ...       Toyota      sport
2          4                   0  ...          BMW      SEDAN

[4 rows x 6 columns]

In [90]:
# to make the dataset look good we need to change columns order 
print(list(Xtest.columns.values))
Xtest = Xtest[['car_company','type',  'cylinder', 'car_company_number', 'type_number', 'over 1200 hp']]
Xtest

['car_company', 'type', 'cylinder', 'car_company_number', 'type_number', 'over 1200 hp']

   car_company       type  ...  type_number  over 1200 hp
3          BMW      COUPE  ...            0             1
13  Rang Rover  HATCHBACK  ...            1             0
7       Toyota      sport  ...            3             1
2          BMW      SEDAN  ...            2             0

[4 rows x 6 columns]